Revit 2027 API
ParameterTypeId.RouteAnalysisSettingsParam Property
 "Route Analysis Settings"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RouteAnalysisSettingsParam { get; }
Public Shared ReadOnly Property RouteAnalysisSettingsParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RouteAnalysisSettingsParam {
	ForgeTypeId^ get ();
}
static member RouteAnalysisSettingsParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace